{
"status": "ok",
"totalResults": 4,
"articles": [
{
"source": {
"id": null,
"name": "Gizmodo Australia"
},
"author": "Owen Bellwood",
"title": "Rolls-Royce Recruited a Fashion Designer to Build its Most Complex Phantom Ever",
"description": "Rolls-Royce isn’t a company that does things in half-measures. It’s built its reputation making the biggest, best and most opulent...\nThe post Rolls-Royce Recruited a Fashion Designer to Build its Most Complex Phantom Ever appeared first on Gizmodo Australia.…",
"url": "https://www.gizmodo.com.au/2023/03/rolls-royce-recruited-a-fashion-designer-to-build-its-most-complex-phantom-ever/",
"urlToImage": "https://www.gizmodo.com.au/wp-content/uploads/sites/2/2023/03/08/ecef48745335d83c09b1540b9d6bead1.jpg?quality=80&resize=1280,720",
"publishedAt": "2023-03-08T04:00:50Z",
"content": "Rolls-Royce isnt a company that does things in half-measures. Its built its reputation making the biggest, best and most opulent cars money can buy, and its latest one-off creation is no different. C… [+3104 chars]"
},
{
"source": {
"id": "the-next-web",
"name": "The Next Web"
},
"author": "Andrea Hak",
"title": "5 things founders want you to know about the Dutch tech scene this Women’s Day",
"description": "Women’s Day is a day when we celebrate the achievements of the amazing women founders, developers, and VCs that are bringing innovation and disruption to the Dutch tech ecosystem. But it should also be a day when we confront the barriers and challenges women …",
"url": "https://thenextweb.com/news/5-founders-dutch-tech-scene-womens-day",
"urlToImage": "https://img-cdn.tnwcdn.com/image/tnw-blurple?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2023%2F03%2FAdd-a-heading-2.jpg&signature=f301cd949572513f28349d64230a44b1",
"publishedAt": "2023-03-08T03:57:26Z",
"content": "Womens Day is a day when we celebrate the achievements of the amazing women founders, developers, and VCs that are bringing innovation and disruption to the Dutch tech ecosystem.\r\nBut it should also … [+18598 chars]"
},
{
"source": {
"id": null,
"name": "Paul Tan's Automotive News"
},
"author": "Gerard Lye",
"title": "Tesla chose to invest in Malaysia because we are the 7th largest producer in the E&E, semiconductor sector",
"description": "Just a few days ago, minister of international trade and industry Tengku Datuk Seri Zafrul Tengku Abdul Aziz revealed Tesla will officially set up shop in Malaysia. This will see the American car company establish […]\nThe post Tesla chose to invest in Malaysi…",
"url": "https://paultan.org/2023/03/08/why-tesla-chose-to-invest-in-malaysia/",
"urlToImage": "https://paultan.org/image/2023/03/tengku-zafrul-tesla-malaysia-1200x630.jpg",
"publishedAt": "2023-03-08T03:47:47Z",
"content": "Just a few days ago, minister of international trade and industry Tengku Datuk Seri Zafrul Tengku Abdul Aziz revealed Tesla will officially set up shop in Malaysia. This will see the American car com… [+1163 chars]"
}
,
{
"source": {
"id": null,
"name": "Biztoc.com"
},
"author": "apnews.com",
"title": "Elon Musk apologizes after mocking laid-off Twitter employee",
"description": "FILE - Tesla and SpaceX CEO Elon Musk speaks at the SATELLITE Conference and Exhibition, March 9, 2020, in Washington. After nine days of being locked out of his Twitter work computer, Haraldur Thorleifsson tweeted at owner Elon Musk, Monday, March 6, 2023, t…",
"url": "https://biztoc.com/x/8bd06d1cc9ae6214",
"urlToImage": "https://c.biztoc.com/p/8bd06d1cc9ae6214/og.webp",
"publishedAt": "2023-03-08T03:42:08Z",
"content": "FILE - Tesla and SpaceX CEO Elon Musk speaks at the SATELLITE Conference and Exhibition, March 9, 2020, in Washington. After nine days of being locked out of his Twitter work computer, Haraldur Thorl… [+303 chars]"
}
]}